// თქვენი სიტყვებით ახსენით რა არის virtual dom, რისთვის ვიყენებთ მას, რა უპირატესობები აქვს და ა.შ,
// ვირტუალუტი dom წვდება იმ კონკრეტულ ნაწილს რისი შეცვლაც გვინდა და შემდეგ dom-თან ადარებს რა ცვლილებაა საჭირო და 
// მხოლოდ იმ ნაწილს ცვლის, არ იტვირთება მთლიანი საიტი ახლიდან და არის უფრო სწრაფი ვიცილებთ ერორების გამოწვევის საფრთხეს .
// ვირტუალური dom არის dom-სი შეილება ითქვას ასლი რომელშიც შეგვიძლია შევიტანოთ ცვლილება და
//  შემდეგ შედარებით მარტივად შევცვალოთ სხვადასხვა ელემენტები

// ასევე ისაუბრეთ რატომ ვერ ვიყენებთ class ატრიბუტს jsx-ში, და შეიძლება თუ არა sef-closing თეგების /-ით არ დამთავრება.
// jsx-ში class ატრიბუტს ვერ ვიყებებთ რადგან class არის js-ში აქვს სხვა მნიშვნელობა და ამიტომ jsx-ში ვიყენებთ className-ს.
// sef-closing თეგების /-ით დამთავრება აუცილებელია jsx-ში მაგრამ გვაქ ისეთი ელემენტებიც რომლებსაც არ სჭირდებათ დამხურავი /-ი
// მაგ: img,br,input და ა.შ. მათ მათ შეილება არ ჰქონდეთ დამხურავი თეგი /-ი