// <!-- 1. შეცვალეთ კონკრეტული ID-ის მქონე აბზაცის ტექსტი „hello, JavaScript!“-ით textContent-ის გამოყენებით.
// 2. აირჩიეთ სათაური მისი ID-ით და შეცვალეთ მისი ტექსტის ფერი ლურჯად JavaScript-ის გამოყენებით.
// 3. გაასწორეთ div-ის ტექსტი ცენტრში JavaScript-ის გამოყენებით (შეცვალეთ style.textAlign თვისება).
// 4. შეცვალეთ მოცემული ID-ის მქონე აბზაცის ფონის ფერი ყვითლად JavaScript-ის გამოყენებით.
// 5. სამი სხვადასხვა აბზაცის ფერი შეცვალეთ წითლად, მწვანედ და ნარინჯისფრად მათი ინდივიდუალური ID-ების გამოყენებით. -->


//1 <p id="p,hjs">hello</p>


//2<h1 id="h1,h">hello</h1>

//3<div id="div,js">JavaScript</div>

//4<p id="p,h">hello</p>

//5<p id="p,g">goa</p><p id="p,o">orientid</p><p id="p,a">academi</p>

