<<<<<<< HEAD
# 1. შექმენით ცვლადი სახელად name, სადაც მომხმარებელს input-ის მეშვეობით შემოატანინებთ სახელს, 
# შემდეგ კი მისალმების მესიჯი, მაგალითად 'hello ' + (სახელი)
name = input("ჩაწერეთ თქვენი სახელი: ")
print("hello " + name)

# 2. შექმენით სამი ცვლადი, სამივეში შეინახეთ განსხვავებული ინფორმაციის ტიპები, 
# შემდეგ კი დაპრინტეთ ისინი
age = 25  
city = "თბილისი" 
is_student = True 

print(age)
print(city)
print(is_student)

# 3. შექმენით ცვლადი სახელად user_name, სადაც მომხმარებელს შემოატანინებთ სახელს, 
# შემდეგ შექმენით ცვლადი სახელად last_name, სადაც მომხმარებელს შემოატანინებთ გვარს, 
# ბოლოს დაუპრინტეთ მსგავსი მესიჯი: 'hello ' + (სახელი) + (გვარი)
user_name = input("ჩაწერეთ თქვენი სახელი: ")
last_name = input("ჩაწერეთ თქვენი გვარი: ")
=======
# 1. შექმენით ცვლადი სახელად name, სადაც მომხმარებელს input-ის მეშვეობით შემოატანინებთ სახელს, 
# შემდეგ კი მისალმების მესიჯი, მაგალითად 'hello ' + (სახელი)
name = input("ჩაწერეთ თქვენი სახელი: ")
print("hello " + name)

# 2. შექმენით სამი ცვლადი, სამივეში შეინახეთ განსხვავებული ინფორმაციის ტიპები, 
# შემდეგ კი დაპრინტეთ ისინი
age = 25  
city = "თბილისი" 
is_student = True 

print(age)
print(city)
print(is_student)

# 3. შექმენით ცვლადი სახელად user_name, სადაც მომხმარებელს შემოატანინებთ სახელს, 
# შემდეგ შექმენით ცვლადი სახელად last_name, სადაც მომხმარებელს შემოატანინებთ გვარს, 
# ბოლოს დაუპრინტეთ მსგავსი მესიჯი: 'hello ' + (სახელი) + (გვარი)
user_name = input("ჩაწერეთ თქვენი სახელი: ")
last_name = input("ჩაწერეთ თქვენი გვარი: ")
>>>>>>> 8a15946c560378624351c12a8843fbaa5f3d43ac
print("hello " + user_name + " " + last_name)