<<<<<<< HEAD
#1. შექმენით სია, სადაც გექნებათ 5 ელემენტი, შემდეგ ინდექსინგის მეშვეობით დაპრინტეთ მეორე ინდექსზე მყოფი ელემენტი.
Colors=["Blue ""Yellow ""Green ""Red"" White"]
print(Colors[2])
#2. კომენტარების მეშვეობით ახსენი რა არის immutable/mutable.
#
=======
#1. შექმენით სია, სადაც გექნებათ 5 ელემენტი, შემდეგ ინდექსინგის მეშვეობით დაპრინტეთ მეორე ინდექსზე მყოფი ელემენტი.
Colors=["Blue ""Yellow ""Green ""Red"" White"]
print(Colors[2])
#2. კომენტარების მეშვეობით ახსენი რა არის immutable/mutable.
#
>>>>>>> 8a15946c560378624351c12a8843fbaa5f3d43ac
#